In [2]:
import numpy as np
import pandas as pd

In [3]:
#dataframe with list
ls=[[1, 2, 3, 4],
   [5, 6, 7, 8]]
df= pd.DataFrame(ls)
df

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [4]:
#dataframe with array
arr= np.arange(1,11).reshape(2,5)
df1= pd.DataFrame(arr, index= ['a', 'b'], columns=['c'+str(x) for x in range(1,6)])
df1

   c1  c2  c3  c4  c5
a   1   2   3   4   5
b   6   7   8   9  10

In [5]:
#dataframe with list and dictionary
ls1=["xyz", "abc", "pqr", "efg"]
ls2=[23, 24, 25, 21]
df2= pd.DataFrame({"Name":ls1, "Age":ls2}, index= np.arange(1,5))
df2

  Name  Age
1  xyz   23
2  abc   24
3  pqr   25
4  efg   21

In [6]:
#dataframe with dictionary
dc={"Name":["palak", "diskha", "jyoti", "swati"], "Age":[23, 22, 24, 24]}
df3= pd.DataFrame(dc, index= np.arange(1,5))
df3

     Name  Age
1   palak   23
2  diskha   22
3   jyoti   24
4   swati   24

In [7]:
#accessing elements
df3.Name #we can use this way when name of column is single valued
df3['Name']

1     palak
2    diskha
3     jyoti
4     swati
Name: Name, dtype: object

In [23]:
#attributes of dataframe
print(df3)
print(df3.index) #index value
print(df3.columns) #column value
print(df3.size)  #number of elements
print(df3.shape) #dimentions of dataframe
print(df3.T)  #transpose the dataframe
print(df3.info) #return no. of nan values, datatype of columns
df3.astype({"Age":float}) #change age column to float

     Name  Age
1   palak   23
2  diskha   22
3   jyoti   24
4   swati   24
Int64Index([1, 2, 3, 4], dtype='int64')
Index(['Name', 'Age'], dtype='object')
8
(4, 2)
          1       2      3      4
Name  palak  diskha  jyoti  swati
Age      23      22     24     24
<bound method DataFrame.info of      Name  Age
1   palak   23
2  diskha   22
3   jyoti   24
4   swati   24>

     Name   Age
1   palak  23.0
2  diskha  22.0
3   jyoti  24.0
4   swati  24.0

In [9]:
#in dataframe we have to give 2 values one for row and one for column
#accessing single element
#at
df3.at[2, 'Name']

'diskha'

In [10]:
#accessing single element with numeric index
#iat
df3.iat[1,0]

'diskha'

In [11]:
#accessing multiple values
#loc
df3.loc[[1, 4], ["Name"]]
df3.loc[[3,2], ['Age','Name']] #order of element is same as written
df3.loc[2:4,[True, False]] #slice and bool
df3.loc[1, :] #complete data of 1 value

Name    palak
Age        23
Name: 1, dtype: object

In [12]:
#accessing multiple values using numeric index
#iloc
df3.iloc[[2, 0, 1], [1]] #we get series
df3.iloc[[2, 0, 1]] #if we give only 1 value we get all the other values
df3.iloc[:,[1]] #we get series
df3.iloc[[1, 3, 2], np.array([True, False])] #boolean array

     Name
2  diskha
4   swati
3   jyoti

In [13]:
#adding column
df3.Hobbies= ['gaming', 'listening music', 'dancing', 'reading books']
df3

C:\Users\Palak Thakur\AppData\Local\Temp\ipykernel_17684\28061106.py:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df3.Hobbies= ['gaming', 'listening music', 'dancing', 'reading books']

     Name  Age
1   palak   23
2  diskha   22
3   jyoti   24
4   swati   24

In [14]:
df4= pd.DataFrame(arr)
print(df4)
#swapping values of 2 columns
df4[[1,3]]= df4[[3,1]]
print('after swapping')
print(df4)

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10
after swapping
   0  1  2  3   4
0  1  4  3  2   5
1  6  9  8  7  10

In [15]:
arr1= np.array([[2, 5], [6, 7]])
df5= pd.DataFrame(np.arange(1,11).reshape((2,5)))
df5

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [16]:
#giving value of np array to dataframe
#changing value 4, 5, 9, 10 to arr1
df5.loc[[0,1],[3,4]]= arr1
df5

   0  1  2  3  4
0  1  2  3  2  5
1  6  7  8  6  7

In [17]:
#dataframe with series
ser= pd.Series(['xyz', 'pqr', 'ijk','lmn'], index= list("ABCD"))
ser1= pd.Series([1, 2, 3, 4,], index= list("ABCD")) #index of both series whould be same
df6= pd.DataFrame({'c1':ser, 'c2':ser1})
df6

    c1  c2
A  xyz   1
B  pqr   2
C  ijk   3
D  lmn   4

In [18]:
#apply
#sum of square of elements
df7= df5.T
print(df7)
def square(seq):
    return (seq**2).sum()
print("rows:")
print(df7.apply(square, axis=1)) #rows
print("columns:")
print(df7.apply(square, axis=0)) #columns

   0  1
0  1  6
1  2  7
2  3  8
3  2  6
4  5  7
rows:
0    37
1    53
2    73
3    40
4    74
dtype: int64
columns:
0     43
1    234
dtype: int64

In [19]:
#grouping
df8= pd.DataFrame(np.arange(1,11).reshape((5,2)), index=list("ABCDE"), columns= [1,2])
print(df8)
df8.groupby(list("ABABA")).sum()

   1   2
A  1   2
B  3   4
C  5   6
D  7   8
E  9  10

    1   2
A  15  18
B  10  12

In [20]:
#idx
#gives label of a column
# we can use min, max with idx
print(df8[1].max()) #it gives max value
df8[1].idxmax() #idx gives label instead of value

9

'E'